#pragma once

//============================================================================
//	include
//============================================================================
#include <Engine/Core/CBuffer/DxConstBuffer.h>

// ここから作成、bufferSizeまで作ってある
// pipelineとか、managerの作成をしてcommandを詰めるようしてください
// sceneに渡して、自由に変えられるようにして下さい
// これが終わったらいよいよmeshShaderを本格的に始めていいです

//============================================================================
//	PostProcessBuffer class
//============================================================================
class IPostProcessBuffer {
public:
	//========================================================================
	//	public Methods
	//========================================================================

	IPostProcessBuffer() = default;
	virtual ~IPostProcessBuffer() = default;

	//--------- accessor -----------------------------------------------------

private:
	//========================================================================
	//	private Methods
	//========================================================================

	//--------- variables ----------------------------------------------------

	UINT rootParameterIndex_ = 0;
};