#pragma once

//============================================================================
//	include
//============================================================================
#include <Engine/Entity/GameEntity3D.h>

//============================================================================
//	PlayerWeapon class
//============================================================================
class PlayerWeapon :
	public GameEntity3D {
public:
	//========================================================================
	//	public Methods
	//========================================================================

	PlayerWeapon() = default;
	~PlayerWeapon() = default;

	void Update() override;

	void DerivedImGui() override;

	// json
	void ApplyJson(const Json& data);
	void SaveJson(Json& data);

	//--------- accessor -----------------------------------------------------

private:
	//========================================================================
	//	private Methods
	//========================================================================

	//--------- variables ----------------------------------------------------

	// parameters
	Transform3DComponent initTransform_; // 初期化時の値

	//--------- functions ----------------------------------------------------

	// helper
	void SetInitTransform();
};